# Pandas practice

2017년 예방접종 데이터 'NISPUF17.csv'


예방 접종 데이터를 통해서


모유 제공과 인플루엔자 백신 투여 수의 관계성을 확인해보기


아이들의 성별과 백신 효과의 연관성이 있는지 확인해보기

In [22]:
import pandas as pd
import numpy as np

In [23]:
data = pd.read_csv('data/1/NISPUF17.csv', index_col=0)
data.index

Int64Index([    1,     2,     3,     4,     5,     6,     7,     8,     9,
               10,
            ...
            28456, 28457, 28458, 28459, 28460, 28461, 28462, 28463, 28464,
            28465],
           dtype='int64', length=28465)

In [24]:
data.columns

Index(['SEQNUMC', 'SEQNUMHH', 'PDAT', 'PROVWT_D', 'RDDWT_D', 'STRATUM', 'YEAR',
       'AGECPOXR', 'HAD_CPOX', 'AGEGRP',
       ...
       'XVRCTY2', 'XVRCTY3', 'XVRCTY4', 'XVRCTY5', 'XVRCTY6', 'XVRCTY7',
       'XVRCTY8', 'XVRCTY9', 'INS_STAT2_I', 'INS_BREAK_I'],
      dtype='object', length=453)

In [25]:
data.head(10)

,SEQNUMC,SEQNUMHH,PDAT,PROVWT_D,RDDWT_D,STRATUM,YEAR,AGECPOXR,HAD_CPOX,AGEGRP,...,XVRCTY2,XVRCTY3,XVRCTY4,XVRCTY5,XVRCTY6,XVRCTY7,XVRCTY8,XVRCTY9,INS_STAT2_I,INS_BREAK_I
1,128521,12852,2,NaN,235.916956,1031,2017,NaN,2,1,...,,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,10741,1074,2,NaN,957.353840,1068,2017,NaN,2,1,...,,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,220011,22001,2,NaN,189.611299,1050,2017,NaN,2,3,...,,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,86131,8613,1,675.430817,333.447418,1040,2017,NaN,2,1,...,,,NaN,NaN,NaN,NaN,NaN,NaN,1.0,2.0
5,227141,22714,1,482.617748,278.768063,1008,2017,NaN,2,1,...,,,NaN,NaN,NaN,NaN,NaN,NaN,2.0,1.0
6,207941,20794,2,NaN,35.995367,1019,2017,NaN,2,2,...,,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,221381,22138,1,516.427723,248.916038,1008,2017,NaN,2,3,...,,,NaN,NaN,NaN,NaN,NaN,NaN,1.0,2.0
8,182861,18286,1,313.225832,163.213401,1001,2017,NaN,2,2,...,,,NaN,NaN,NaN,NaN,NaN,NaN,3.0,2.0
9,161121,16112,1,978.042448,718.616990,1016,2017,3.0,1,1,...,,,NaN,NaN,NaN,NaN,NaN,NaN,4.0,4.0
10,143401,14340,2,NaN,1536.859533,1068,2017,NaN,2,3,...,,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

부모들의 학력 비율
```
[EDUC1] = "less than high school" : 1
          "high school" : 2
          "more than high school but not college" : 3
          "college" : 4
```

In [26]:
educ1=data['EDUC1'].value_counts()

In [27]:
educ1

4    13656
3     6999
2     4906
1     2904
Name: EDUC1, dtype: int64

In [28]:
total=sum(educ1)
total

28465

In [29]:
parents_edu_ratio = {"less than high school":educ1[1]/total,
                    "high school":educ1[2]/total,
                    "more than high school but not college":educ1[3]/total,
                    "college":educ1[4]/total}
parents_edu_ratio

{'less than high school': 0.10202002459160373,
 'high school': 0.172352011241876,
 'more than high school but not college': 0.24588090637625154,
 'college': 0.47974705779026877}

모유 제공과 인플루엔자 백신 투여 수의 관계성

breastmilk를 제공받은 아이들과 그렇지 못한 아이들의 평균 인플루엔자 백신 투여 수를 확인
```
[P_NUMFLU] : total number of influenza does

[CBF_01] = child fed breast milk: Yes = 1
                                  No = 2
```

In [30]:
columns=['P_NUMFLU', 'CBF_01']
df=data[columns]
df

       P_NUMFLU  CBF_01
1           NaN       1
2           NaN       2
3           NaN       2
4           3.0       2
5           0.0       1
...         ...     ...
28461       NaN       2
28462       NaN       1
28463       NaN       1
28464       NaN       2
28465       NaN       1

[28465 rows x 2 columns]

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 28465 entries, 1 to 28465
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   P_NUMFLU  15333 non-null  float64
 1   CBF_01    28465 non-null  int64
dtypes: float64(1), int64(1)
memory usage: 667.1 KB

In [32]:
bm_sum = df.P_NUMFLU.where(df['CBF_01']==1).dropna().sum()
bm_count = df.P_NUMFLU.where(df['CBF_01']==1).dropna().count()
bm_avg = bm_sum/bm_count
nobm_sum = df.P_NUMFLU.where(df['CBF_01']==2).dropna().sum()
nobm_count = df.P_NUMFLU.where(df['CBF_01']==2).dropna().count()
nobm_avg = nobm_sum/nobm_count
nobm_avg

1.5963945918878317

In [36]:
print("모유 제공받은 아이들의 평균 백신 투여 수: {}".format(bm_avg))
print("모유 제공받지 못한 아이들의 평균 백신 투여 수: {}".format(nobm_avg))

모유 제공받은 아이들의 평균 백신 투여 수: 1.8799187420058687
모유 제공받지 못한 아이들의 평균 백신 투여 수: 1.5963945918878317

아이들의 성별과 백신 효과의 연관성이 있는지 확인

성별에 따라
백신을 맞은 아이들 중에서 ( ['P_NUUMVRC'] > 0 )
chikenpox(수두(병 이름?))에 걸린 적이 있는지 확인 ( ['HAD_CPOX'] )

In [37]:
columns=['SEX', 'HAD_CPOX', 'P_NUMVRC']
data=data[columns].dropna()

In [38]:
data

       SEX  HAD_CPOX  P_NUMVRC
4        2         2       1.0
5        2         2       0.0
7        2         2       1.0
8        2         2       0.0
9        1         1       0.0
...    ...       ...       ...
28447    2         2       1.0
28448    1         2       1.0
28450    1         2       1.0
28453    2         2       1.0
28455    2         2       1.0

[15333 rows x 3 columns]

In [39]:
male_data=data[data['SEX']==1]
female_data=data[data['SEX']==2]

In [40]:
male_data

       SEX  HAD_CPOX  P_NUMVRC
9        1         1       0.0
11       1         2       1.0
13       1         2       1.0
17       1         2       2.0
20       1         2       1.0
...    ...       ...       ...
28436    1         2       1.0
28437    1         2       1.0
28439    1         2       1.0
28448    1         2       1.0
28450    1         2       1.0

[7819 rows x 3 columns]

In [46]:
male_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7819 entries, 9 to 28450
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   SEX       7819 non-null   int64
 1   HAD_CPOX  7819 non-null   int64
 2   P_NUMVRC  7819 non-null   float64
dtypes: float64(1), int64(2)
memory usage: 244.3 KB

In [41]:
male_vrc = male_data[male_data['P_NUMVRC']>0]
female_vrc = female_data[female_data['P_NUMVRC']>0]

In [42]:
male_cpx = male_vrc[male_vrc['HAD_CPOX']==1]['SEX'].count()
male_nocpx = male_vrc[male_vrc['HAD_CPOX']==2]['SEX'].count()
female_cpx = female_vrc[female_vrc['HAD_CPOX']==1]['SEX'].count()
female_nocpx = female_vrc[female_vrc['HAD_CPOX']==2]['SEX'].count()

In [51]:
male_ratio=male_cpx/(male_nocpx + male_cpx)
female_ratio=female_cpx/(female_nocpx+female_cpx)

In [52]:
male_ratio

0.009582863585118376

In [53]:
female_ratio

0.007731582786287381

In [54]:
print("백신 맞은 남자 아이들의 cpx 걸린 비율: {}".format(male_ratio))
print("백신 맞은 여자 아이들의 cpx 걸린 비율: {}".format(female_ratio))

백신 맞은 남자 아이들의 cpx 걸린 비율: 0.009582863585118376
백신 맞은 여자 아이들의 cpx 걸린 비율: 0.007731582786287381